; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v13)
             (pred_5 ?v4 ?v3)
             (pred_7 ?v10 ?v3)
             (pred_4 ?v8 ?v10 )
	     (pred_8 ?v10)
             (pred_11 ?v11)
             (pred_2 ?v4)
             (pred_9 ?v3)
             (pred_10 ?v10)
             (pred_12 ?v4)
             (pred_3 ?v10)
             (pred_1 ))



(:action op_3
:parameters (?v2 ?v1 ?v5 ?v7)
:precondition (and (pred_11 ?v2) (pred_11 ?v1) (pred_2 ?v5) (pred_9 ?v7)
          (pred_6 ?v2 ?v1) (pred_5 ?v5 ?v7)
                   (pred_7 ?v1 ?v7) (pred_8 ?v2) 
                   (pred_10 ?v1) (pred_12 ?v5))
:effect (and  (pred_3 ?v1) (not (pred_10 ?v1))))


(:action op_4
:parameters (?v2 ?v6)
:precondition (and (pred_11 ?v2) (pred_11 ?v6)
               (pred_8 ?v2) (pred_6 ?v2 ?v6) (pred_3 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v2))))

(:action op_5
:parameters (?v2 ?v5)
:precondition (and (pred_11 ?v2) (pred_2 ?v5) 
                  (pred_8 ?v2) (pred_4 ?v5 ?v2) (pred_1 ))
:effect (and (pred_12 ?v5)
   (not (pred_4 ?v5 ?v2)) (not (pred_1 ))))


(:action op_1
:parameters (?v2 ?v9 ?v12)
:precondition (and (pred_11 ?v2) (pred_2 ?v9) (pred_2 ?v12)
                  (pred_8 ?v2) (pred_12 ?v12) (pred_4 ?v9 ?v2))
:effect (and (pred_12 ?v9) (pred_4 ?v12 ?v2)
        (not (pred_12 ?v12)) (not (pred_4 ?v9 ?v2))))

(:action op_2
:parameters (?v2 ?v5)
:precondition (and (pred_11 ?v2) (pred_2 ?v5) 
                  (pred_8 ?v2) (pred_12 ?v5))
:effect (and (pred_1 ) (pred_4 ?v5 ?v2) (not (pred_12 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_04 obj_18 obj_13 obj_08 obj_07 obj_22 obj_21 obj_16 obj_02 obj_10 obj_03 obj_01 obj_17 obj_05 obj_19
    obj_14 obj_12 obj_20
    obj_15 obj_11 obj_09
    )

    (:init
       (pred_1)

       (pred_11 obj_06)
       (pred_11 obj_04)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_08)
       (pred_11 obj_07)
       (pred_11 obj_22)
       (pred_11 obj_21)
       (pred_11 obj_16)
       (pred_11 obj_02)
       (pred_11 obj_10)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_17)
       (pred_11 obj_05)
       (pred_11 obj_19)
       (pred_9 obj_14)
       (pred_9 obj_12)
       (pred_9 obj_20)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_09)

       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_04 obj_07)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_18 obj_22)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_13 obj_21)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_07 obj_22)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_22 obj_10)
       (pred_6 obj_22 obj_21)
       (pred_6 obj_22 obj_18)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_21 obj_03)
       (pred_6 obj_21 obj_13)
       (pred_6 obj_21 obj_22)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_02)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_02 obj_17)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_16)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_03)
       (pred_6 obj_10 obj_22)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_03 obj_19)
       (pred_6 obj_03 obj_21)
       (pred_6 obj_03 obj_10)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_17 obj_05)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_05 obj_19)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_17)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_19 obj_05)
       (pred_10 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_19)
       (pred_7  obj_18 obj_14)
       (pred_7  obj_08 obj_12)
       (pred_7  obj_19 obj_20)
       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_22)
       (pred_3 obj_21)
       (pred_3 obj_16)
       (pred_3 obj_02)
       (pred_3 obj_10)
       (pred_3 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_17)
       (pred_3 obj_05)

       (pred_5  obj_15 obj_14)
       (pred_5  obj_11 obj_12)
       (pred_5  obj_09 obj_20)
       (pred_4 obj_15 obj_02)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_09 obj_08)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_4 obj_11 obj_13)
    ))
(:constraints
  (always (not (pred_8 obj_22)))
)
)

; plan
1. (op_4 obj_01 obj_16)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_16)
   goals met: 0 of 1
2. (op_4 obj_16 obj_02)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_02)
   goals met: 0 of 1
3. (op_5 obj_02 obj_11)
   deleted: (pred_4 obj_11 obj_02) (pred_1)
   added: (pred_12 obj_11)
   goals met: 0 of 1
4. (op_4 obj_02 obj_10)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_03)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_03)
   goals met: 0 of 1
6. (op_4 obj_03 obj_21)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_21)
   goals met: 0 of 1
7. (op_4 obj_21 obj_13)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_13)
   goals met: 0 of 1
8. (op_2 obj_13 obj_11)
   deleted: (pred_12 obj_11)
   added: (pred_1) (pred_4 obj_11 obj_13)
   goals met: 1 of 1
